# Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

# *Пример:*

# 2 2
#     4 


import mylib

print (mylib.sum(int(input("Введите первое число: ")), (int(input("Введит второе число: ")))))

