# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите трехзначное число: "))
i = 0
res = 0
while i < 3:
    x = n % 10
    res += x
    n //= 10
    i += 1
print(res)
