# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков;
# Q, Z – 10 очков. А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка; Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.

# *Пример:*

# ноутбук
#     12

word = str(input("Введите ваше слово: "))
word = word.upper()
i = 0
res = 0
onepoint = ["A", "E", "I", "O", "U", "L", "N", "S", "T",
            "R", "А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"]
twopoint = ["D", "G", "Д", "К", "Л", "М", "П", "У"]
threepoint = ["B", "C", "M", "P", "Б", "Г", "Ё", "Ь", "Я"]
fourpoint = ["F", "H", "V", "W", "Y", "Й", "Ы"]
fivepoint = ["K", "Ж", "З", "Х", "Ц", "Ч"]
eightpoint = ["J", "X", "Ш", "Э", "Ю"]
tenpoint = ["Q", "Z", "Ф", "Щ", "Ъ"]

for i in range(len(word)):
    if word[i] in onepoint:
        res += 1
    elif word[i] in twopoint:
        res += 2
    elif word[i] in threepoint:
        res += 3
    elif word[i] in fourpoint:
        res += 4
    elif word[i] in fivepoint:
        res += 5
    elif word[i] in eightpoint:
        res += 8
    elif word[i] in tenpoint:
        res += 10
print(res)
